Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxQspi_bf.h
/** \brief Length for Ifx_QSPI_XXLCON_Bits.XDL */
#define IFX_QSPI_XXLCON_XDL_LEN (16u)

/** \brief Mask for Ifx_QSPI_XXLCON_Bits.XDL */
#define IFX_QSPI_XXLCON_XDL_MSK (0xffffu)

/** \brief Offset for Ifx_QSPI_XXLCON_Bits.XDL */
#define IFX_QSPI_XXLCON_XDL_OFF (0u)

/** \brief Length for Ifx_QSPI_XXLCON_Bits.BYTECOUNT */
#define IFX_QSPI_XXLCON_BYTECOUNT_LEN (16u)

/** \brief Mask for Ifx_QSPI_XXLCON_Bits.BYTECOUNT */
#define IFX_QSPI_XXLCON_BYTECOUNT_MSK (0xffffu)

/** \brief Offset for Ifx_QSPI_XXLCON_Bits.BYTECOUNT */
#define IFX_QSPI_XXLCON_BYTECOUNT_OFF (16u)

/** \brief Length for Ifx_QSPI_MIXENTRY_Bits.E */
#define IFX_QSPI_MIXENTRY_E_LEN (32u)

/** \brief Mask for Ifx_QSPI_MIXENTRY_Bits.E */
#define IFX_QSPI_MIXENTRY_E_MSK (0xffffffffu)

/** \brief Offset for Ifx_QSPI_MIXENTRY_Bits.E */
#define IFX_QSPI_MIXENTRY_E_OFF (0u)

/** \brief Length for Ifx_QSPI_BACONENTRY_Bits.E */
#define IFX_QSPI_BACONENTRY_E_LEN (32u)

/** \brief Mask for Ifx_QSPI_BACONENTRY_Bits.E */
#define IFX_QSPI_BACONENTRY_E_MSK (0xffffffffu)

/** \brief Offset for Ifx_QSPI_BACONENTRY_Bits.E */
#define IFX_QSPI_BACONENTRY_E_OFF (0u)

/** \brief Length for Ifx_QSPI_DATAENTRY_Bits.E */
#define IFX_QSPI_DATAENTRY_E_LEN (32u)

/** \brief Mask for Ifx_QSPI_DATAENTRY_Bits.E */
#define IFX_QSPI_DATAENTRY_E_MSK (0xffffffffu)

/** \brief Offset for Ifx_QSPI_DATAENTRY_Bits.E */
#define IFX_QSPI_DATAENTRY_E_OFF (0u)

/** \brief Length for Ifx_QSPI_RXEXIT_Bits.E */
#define IFX_QSPI_RXEXIT_E_LEN (32u)

/** \brief Mask for Ifx_QSPI_RXEXIT_Bits.E */
#define IFX_QSPI_RXEXIT_E_MSK (0xffffffffu)

/** \brief Offset for Ifx_QSPI_RXEXIT_Bits.E */
#define IFX_QSPI_RXEXIT_E_OFF (0u)

/** \brief Length for Ifx_QSPI_RXEXITD_Bits.E */
#define IFX_QSPI_RXEXITD_E_LEN (32u)

/** \brief Mask for Ifx_QSPI_RXEXITD_Bits.E */
#define IFX_QSPI_RXEXITD_E_MSK (0xffffffffu)

/** \brief Offset for Ifx_QSPI_RXEXITD_Bits.E */
#define IFX_QSPI_RXEXITD_E_OFF (0u)

/** \brief Length for Ifx_QSPI_MC_Bits.MCOUNT */
#define IFX_QSPI_MC_MCOUNT_LEN (13u)

/** \brief Mask for Ifx_QSPI_MC_Bits.MCOUNT */
#define IFX_QSPI_MC_MCOUNT_MSK (0x1fffu)

/** \brief Offset for Ifx_QSPI_MC_Bits.MCOUNT */
#define IFX_QSPI_MC_MCOUNT_OFF (0u)

/** \brief Length for Ifx_QSPI_MC_Bits.CURRENT */
#define IFX_QSPI_MC_CURRENT_LEN (13u)

/** \brief Mask for Ifx_QSPI_MC_Bits.CURRENT */
#define IFX_QSPI_MC_CURRENT_MSK (0x1fffu)

/** \brief Offset for Ifx_QSPI_MC_Bits.CURRENT */
#define IFX_QSPI_MC_CURRENT_OFF (16u)

/** \brief Length for Ifx_QSPI_MCCON_Bits.TPRE2 */
#define IFX_QSPI_MCCON_TPRE2_LEN (3u)

/** \brief Mask for Ifx_QSPI_MCCON_Bits.TPRE2 */
#define IFX_QSPI_MCCON_TPRE2_MSK (0x7u)

/** \brief Offset for Ifx_QSPI_MCCON_Bits.TPRE2 */
#define IFX_QSPI_MCCON_TPRE2_OFF (0u)

/** \brief Length for Ifx_QSPI_MCCON_Bits.TRAIL2 */
#define IFX_QSPI_MCCON_TRAIL2_LEN (3u)

/** \brief Mask for Ifx_QSPI_MCCON_Bits.TRAIL2 */
#define IFX_QSPI_MCCON_TRAIL2_MSK (0x7u)

/** \brief Offset for Ifx_QSPI_MCCON_Bits.TRAIL2 */
#define IFX_QSPI_MCCON_TRAIL2_OFF (3u)

/** \brief Length for Ifx_QSPI_MCCON_Bits.IBLEN */
#define IFX_QSPI_MCCON_IBLEN_LEN (1u)

/** \brief Mask for Ifx_QSPI_MCCON_Bits.IBLEN */
#define IFX_QSPI_MCCON_IBLEN_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_MCCON_Bits.IBLEN */
#define IFX_QSPI_MCCON_IBLEN_OFF (16u)

/** \brief Length for Ifx_QSPI_MCCON_Bits.IBLF */
#define IFX_QSPI_MCCON_IBLF_LEN (1u)

/** \brief Mask for Ifx_QSPI_MCCON_Bits.IBLF */
#define IFX_QSPI_MCCON_IBLF_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_MCCON_Bits.IBLF */
#define IFX_QSPI_MCCON_IBLF_OFF (17u)

/** \brief Length for Ifx_QSPI_MCCON_Bits.IBLC */
#define IFX_QSPI_MCCON_IBLC_LEN (1u)

/** \brief Mask for Ifx_QSPI_MCCON_Bits.IBLC */
#define IFX_QSPI_MCCON_IBLC_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_MCCON_Bits.IBLC */
#define IFX_QSPI_MCCON_IBLC_OFF (18u)

/** \brief Length for Ifx_QSPI_MCCON_Bits.IBLS */
#define IFX_QSPI_MCCON_IBLS_LEN (1u)

/** \brief Mask for Ifx_QSPI_MCCON_Bits.IBLS */
#define IFX_QSPI_MCCON_IBLS_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_MCCON_Bits.IBLS */
#define IFX_QSPI_MCCON_IBLS_OFF (19u)

/** \brief Length for Ifx_QSPI_MCCON_Bits.IALEN */
#define IFX_QSPI_MCCON_IALEN_LEN (1u)

/** \brief Mask for Ifx_QSPI_MCCON_Bits.IALEN */
#define IFX_QSPI_MCCON_IALEN_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_MCCON_Bits.IALEN */
#define IFX_QSPI_MCCON_IALEN_OFF (20u)

/** \brief Length for Ifx_QSPI_MCCON_Bits.IALF */
#define IFX_QSPI_MCCON_IALF_LEN (1u)

/** \brief Mask for Ifx_QSPI_MCCON_Bits.IALF */
#define IFX_QSPI_MCCON_IALF_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_MCCON_Bits.IALF */
#define IFX_QSPI_MCCON_IALF_OFF (21u)

/** \brief Length for Ifx_QSPI_MCCON_Bits.IALC */
#define IFX_QSPI_MCCON_IALC_LEN (1u)

/** \brief Mask for Ifx_QSPI_MCCON_Bits.IALC */
#define IFX_QSPI_MCCON_IALC_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_MCCON_Bits.IALC */
#define IFX_QSPI_MCCON_IALC_OFF (22u)

/** \brief Length for Ifx_QSPI_MCCON_Bits.IALS */
#define IFX_QSPI_MCCON_IALS_LEN (1u)

/** \brief Mask for Ifx_QSPI_MCCON_Bits.IALS */
#define IFX_QSPI_MCCON_IALS_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_MCCON_Bits.IALS */
#define IFX_QSPI_MCCON_IALS_OFF (23u)

/** \brief Length for Ifx_QSPI_MCCON_Bits.T2EN */
#define IFX_QSPI_MCCON_T2EN_LEN (1u)

/** \brief Mask for Ifx_QSPI_MCCON_Bits.T2EN */
#define IFX_QSPI_MCCON_T2EN_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_MCCON_Bits.T2EN */
#define IFX_QSPI_MCCON_T2EN_OFF (30u)

/** \brief Length for Ifx_QSPI_MCCON_Bits.MCEN */
#define IFX_QSPI_MCCON_MCEN_LEN (1u)

/** \brief Mask for Ifx_QSPI_MCCON_Bits.MCEN */
#define IFX_QSPI_MCCON_MCEN_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_MCCON_Bits.MCEN */
#define IFX_QSPI_MCCON_MCEN_OFF (31u)

/** \brief Length for Ifx_QSPI_OCS_Bits.SUS */
#define IFX_QSPI_OCS_SUS_LEN (4u)

/** \brief Mask for Ifx_QSPI_OCS_Bits.SUS */
#define IFX_QSPI_OCS_SUS_MSK (0xfu)

/** \brief Offset for Ifx_QSPI_OCS_Bits.SUS */
#define IFX_QSPI_OCS_SUS_OFF (24u)

/** \brief Length for Ifx_QSPI_OCS_Bits.SUS_P */
#define IFX_QSPI_OCS_SUS_P_LEN (1u)

/** \brief Mask for Ifx_QSPI_OCS_Bits.SUS_P */
#define IFX_QSPI_OCS_SUS_P_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_OCS_Bits.SUS_P */
#define IFX_QSPI_OCS_SUS_P_OFF (28u)

/** \brief Length for Ifx_QSPI_OCS_Bits.SUSSTA */
#define IFX_QSPI_OCS_SUSSTA_LEN (1u)

/** \brief Mask for Ifx_QSPI_OCS_Bits.SUSSTA */
#define IFX_QSPI_OCS_SUSSTA_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_OCS_Bits.SUSSTA */
#define IFX_QSPI_OCS_SUSSTA_OFF (29u)

/** \brief Length for Ifx_QSPI_KRSTCLR_Bits.CLR */
#define IFX_QSPI_KRSTCLR_CLR_LEN (1u)

/** \brief Mask for Ifx_QSPI_KRSTCLR_Bits.CLR */
#define IFX_QSPI_KRSTCLR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_KRSTCLR_Bits.CLR */
#define IFX_QSPI_KRSTCLR_CLR_OFF (0u)

/** \brief Length for Ifx_QSPI_KRST1_Bits.RST */
#define IFX_QSPI_KRST1_RST_LEN (1u)

